In [1]:
import pandas as pd
import glob
import pyodbc
from sqlalchemy import create_engine
import time

In [2]:
file_path = r".\\ecommerce dataset"
SERVER = 'amf'
dwh_engine = create_engine('mssql+pyodbc://@localhost/staging?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes')

In [3]:
def import_csv_files(folder_path):
    df_names = []
    csv_files = glob.glob(folder_path + '/*.csv')
    dataframes = {}
    for file in csv_files:
        file_name = file.split('/')[-1].split('.')[1].replace('\\', ' ').strip()
        df_names.append(file_name)
        df = pd.read_csv(file)
        dataframes[file_name] = df
    return dataframes,df_names
dataframes,df_names = import_csv_files(file_path)
df_names

['feedback_dataset',
 'order_dataset',
 'order_item_dataset',
 'payment_dataset',
 'products_dataset',
 'seller_dataset',
 'user_dataset']

lets start exploring user dataset

In [4]:
user_df = dataframes[df_names[6]]
print(user_df.columns)
user_df.head(2)

Index(['user_name', 'customer_zip_code', 'customer_city', 'customer_state'], dtype='object')

,user_name,customer_zip_code,customer_city,customer_state
0,861eff4711a542e4b93843c6dd7febb0,14409,KABUPATEN PEKALONGAN,JAWA TENGAH
1,290c77bc529b7ac935b93aa66c333dc3,9790,KOTA BEKASI,JAWA BARAT

In [5]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_name          99441 non-null  object
 1   customer_zip_code  99441 non-null  int64
 2   customer_city      99441 non-null  object
 3   customer_state     99441 non-null  object
dtypes: int64(1), object(3)
memory usage: 3.0+ MB

In [6]:
user_df.duplicated().sum()

3089

In [7]:
user_df['user_name'].describe()

count                                99441
unique                               96096
top       8d50f5eadf50201ccdcedfb9e2ac8455
freq                                    17
Name: user_name, dtype: object

In [8]:
user_df.drop_duplicates(inplace=True)
user_df.duplicated().sum()

0

In [9]:
user_df.isnull().sum()

user_name            0
customer_zip_code    0
customer_city        0
customer_state       0
dtype: int64

now lets move to next dataset

In [10]:
seller_df= dataframes['seller_dataset']
print(seller_df.columns)
seller_df.head(2)

Index(['seller_id', 'seller_zip_code', 'seller_city', 'seller_state'], dtype='object')

,seller_id,seller_zip_code,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,KOTA JAKARTA TIMUR,DKI JAKARTA
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,KOTA PADANG PANJANG,SUMATERA BARAT

In [11]:
seller_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   seller_id        3095 non-null   object
 1   seller_zip_code  3095 non-null   int64
 2   seller_city      3095 non-null   object
 3   seller_state     3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

In [12]:
seller_df.duplicated().sum()

0

In [13]:
seller_df['seller_id'].describe()

count                                 3095
unique                                3095
top       3442f8959a84dea7ee197c632cb2df15
freq                                     1
Name: seller_id, dtype: object

In [14]:
seller_df.isnull().sum()

seller_id          0
seller_zip_code    0
seller_city        0
seller_state       0
dtype: int64

In [15]:
product_df = dataframes[df_names[4]]
print(product_df.columns)
product_df.head(2)

Index(['product_id', 'product_category', 'product_name_lenght',
       'product_description_lenght', 'product_photos_qty', 'product_weight_g',
       'product_length_cm', 'product_height_cm', 'product_width_cm'],
      dtype='object')

,product_id,product_category,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumery,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,art,44.0,276.0,1.0,1000.0,30.0,18.0,20.0

In [16]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product_category            32328 non-null  object
 2   product_name_lenght         32341 non-null  float64
 3   product_description_lenght  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB

In [17]:
product_df.isnull().sum()

product_id                      0
product_category              623
product_name_lenght           610
product_description_lenght    610
product_photos_qty            610
product_weight_g                2
product_length_cm               2
product_height_cm               2
product_width_cm                2
dtype: int64

In [18]:
product_df['product_id'].describe()

count                                32951
unique                               32951
top       1e9e8ef04dbcff4541ed26657ea517e5
freq                                     1
Name: product_id, dtype: object

In [19]:
product_df.duplicated().sum()

0

all the column looks good lets move to the next dataset

In [20]:
payment_df = dataframes[df_names[3]]
print(payment_df.columns)
payment_df.head(2)

Index(['order_id', 'payment_sequential', 'payment_type',
       'payment_installments', 'payment_value'],
      dtype='object')

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99330.0
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24390.0

In [21]:
payment_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [22]:
payment_df.duplicated().sum()

0

In [23]:
payment_df['order_id'].describe()

count                               103886
unique                               99440
top       fa65dad1b0e818e3ccc5cb0e39231352
freq                                    29
Name: order_id, dtype: object

In [24]:
payment_df['payment_type'].value_counts()

payment_type
credit_card    76795
blipay         19784
voucher         5775
debit_card      1529
not_defined        3
Name: count, dtype: int64

the next dataset is order_item dataset

In [25]:
order_item_df = dataframes[df_names[2]]
order_item_df.head(2)

,order_id,order_item_id,product_id,seller_id,pickup_limit_date,price,shipping_cost
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58900.0,13290.0
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239900.0,19930.0

In [26]:
order_item_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   order_id           112650 non-null  object
 1   order_item_id      112650 non-null  int64
 2   product_id         112650 non-null  object
 3   seller_id          112650 non-null  object
 4   pickup_limit_date  112650 non-null  object
 5   price              112650 non-null  float64
 6   shipping_cost      112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB

In [27]:
order_item_df.duplicated().sum()

0

In [28]:
order_item_df['order_id'].describe()

count                               112650
unique                               98666
top       8272b63d03f5f79c56e9e4120aec44ef
freq                                    21
Name: order_id, dtype: object

next order dataset

In [29]:
order_df = dataframes[df_names[1]]
order_df.head(2)

,order_id,user_name,order_status,order_date,order_approved_date,pickup_date,delivered_date,estimated_time_delivery
0,e481f51cbdc54678b7cc49136f2d6af7,7c396fd4830fd04220f754e42b4e5bff,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,af07308b275d755c9edb36a90c618231,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00

In [30]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   order_id                 99441 non-null  object
 1   user_name                99441 non-null  object
 2   order_status             99441 non-null  object
 3   order_date               99441 non-null  object
 4   order_approved_date      99281 non-null  object
 5   pickup_date              97658 non-null  object
 6   delivered_date           96476 non-null  object
 7   estimated_time_delivery  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB

In [31]:
order_df.duplicated().sum()

0

In [32]:
order_df.isnull().sum()

order_id                      0
user_name                     0
order_status                  0
order_date                    0
order_approved_date         160
pickup_date                1783
delivered_date             2965
estimated_time_delivery       0
dtype: int64

In [33]:
order_df['order_id'].describe()

count                                99441
unique                               99441
top       e481f51cbdc54678b7cc49136f2d6af7
freq                                     1
Name: order_id, dtype: object

the last dataset is feedback dataset

In [34]:
feedback_df = dataframes[df_names[0]]
feedback_df.head(2)

,feedback_id,order_id,feedback_score,feedback_form_sent_date,feedback_answer_date
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,2018-03-10 00:00:00,2018-03-11 03:05:13

In [35]:
feedback_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 5 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   feedback_id              100000 non-null  object
 1   order_id                 100000 non-null  object
 2   feedback_score           100000 non-null  int64
 3   feedback_form_sent_date  100000 non-null  object
 4   feedback_answer_date     100000 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

In [36]:
feedback_df.duplicated().sum()

0

In [37]:
feedback_df.duplicated(subset=['order_id','feedback_id' ]).sum()

0

In [60]:
df = order_df[order_df['order_id']=='9191e958cc19129b8470df9d933f8e3c']
df

,order_id,user_name,order_status,order_date,order_approved_date,pickup_date,delivered_date,estimated_time_delivery
16795,9191e958cc19129b8470df9d933f8e3c,8c23c0f5f18a44384f7632fa3c2a1394,invoiced,2017-11-30 19:12:28,2017-12-01 09:31:11,NaN,NaN,2017-12-20 00:00:00

In [64]:
order_df.head(2)

,order_id,user_name,order_status,order_date,order_approved_date,pickup_date,delivered_date,estimated_time_delivery
0,e481f51cbdc54678b7cc49136f2d6af7,7c396fd4830fd04220f754e42b4e5bff,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,af07308b275d755c9edb36a90c618231,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00

In [47]:

def connect_to_db(server=SERVER):
    try:
        conn = pyodbc.connect(
            'DRIVER={SQL Server};'
            F'SERVER={SERVER};'
            'DATABASE=staging;'
            'Trusted_Connection=yes;'
        )
        print("Database connection successful")
        return conn
    except Exception as e:
        print("Database Error", f"Error connecting to the database: {e}")
        return None
conn = connect_to_db()
cursor = conn.cursor()

Database connection successful

In [ ]:
# creating tables for staging  process  
cursor.execute("""
    CREATE TABLE products( 
                product_id varchar(50) , 
                product_category varchar(50),
                product_name_lenght numeric(10,2),
                product_description_lenght numeric(10,2),
                product_photos_qty numeric(10,2),
                product_weight_g numeric(10,2),
                product_length_cm numeric(10,2),
                product_height_cm numeric(10,2),
                product_width_cm numeric(10,2),
                primary key (product_id)
    )
    """
)
time.sleep(1)
cursor.execute("""
    CREATE TABLE feedback(
                feedback_id varchar(50),
                order_id varchar(50),
                feedback_score int,
                feedback_form_sent_date datetime,
                feedback_answer_date datetime
    )
    """
)
time.sleep(1)
cursor.execute("""
    CREATE TABLE users(
                user_key int identity(1,1) primary key,
                user_name varchar(50),
                customer_zip_code int,
                customer_city varchar(50),
                customer_state varchar(50)
    )
    """
)
cursor.execute("""
    CREATE TABLE sellers(
                seller_key int identity(1,1) primary key,
                seller_id varchar(50),
                seller_zip_code int, 
                seller_city varchar(50),
                seller_state varchar(50)
    )
    """
)
time.sleep(1)
cursor.execute("""
    CREATE TABLE payment(
                order_id varchar(50),
                payment_sequential int,
                payment_type varchar(30),
                payment_installments smallint,
                payment_value decimal(12,2)
    )
    """
)
time.sleep(1)
cursor.execute("""
    CREATE TABLE orders(
                order_id varchar(50),
                user_name varchar(50),
                order_status varchar(50),
                order_date datetime,
                order_approved_date datetime,
                pickup_date datetime,
                delivered_date datetime,
                estimated_time_delivery datetime
    )
    """
)
time.sleep(1)
cursor.execute("""
    CREATE TABLE order_items(
                order_id varchar(50),
                order_item_id smallint,
                product_id varchar(50),
                seller_id varchar(50),
                pickup_limit_date datetime,
                price decimal(12,2),
                shipping_cost decimal(12,2)
    )
    """
)
conn.commit()

In [ ]:
# upload the data to the staging database
order_item_df.to_sql('order_items', con=dwh_engine, if_exists='append', index=False)
order_df.to_sql('orders', con=dwh_engine, if_exists='append', index=False)
user_df.to_sql('users', con=dwh_engine, if_exists='append', index=False)
seller_df.to_sql('sellers', con=dwh_engine, if_exists='append', index=False)
payment_df.to_sql('payment', con=dwh_engine, if_exists='append', index=False)
feedback_df.to_sql('feedback', con=dwh_engine, if_exists='append', index=False)
product_df.to_sql('products', con=dwh_engine, if_exists='append', index=False)

In [49]:
# close connection
conn.commit()
cursor.close()
conn.close()